# Написать свой модуль utils и перенести в него функцию currency_rates() из предыдущего задания.
# Создать скрипт, в котором импортировать этот модуль и выполнить несколько вызовов функции currency_rates().
# Убедиться, что ничего лишнего не происходит.

import Utils

currency = input('Enter the currency that rate exchange you would like to know: ')
print(Utils.currency_rates(currency))

